app/controllers/account_controller.rb

  def login
	@user = session[:user]=User.find_by_id(1);
---
SELECT * FROM `users` WHERE (`users`.`id` = '--- :first\n') LIMIT 1