app/controllers/home_controller.rb

	def retrieveNotes
		user = session[:user] #= User.find_by_id(1)
		notes = Note.find_all_by_user_id(user.id, :include => [:tags])
---
SELECT * FROM `notes` WHERE (`notes`.`user_id` = '1') LIMIT 1

	def saveNote
		@note = Note.find_by_id(params[:note][:id])

		if @note == nil
			@note = Note.new(params[:note])
			@note.save
---
SELECT * FROM `notes` WHERE (`notes`.`id` = -609418948) LIMIT 1
INSERT INTO `notes` (`created_at`, `updated_at`, `user_id`, `content`) VALUES('2009-07-20 05:18:15', '2009-07-20 05:18:15', 1, 'testing testing')
UPDATE `notes` SET `content` = 'testing2 testing', `updated_at` = '2009-07-20 06:00:50', `user_id` = 1 WHERE `id` = 1