app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `updated_at`, `last_name`, `first_name`, `active`) VALUES('2009-07-05 20:42:12', '2009-07-05 20:42:12', 'test', 'test', 1)